---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonDiameter
source: html/370e8ff2-d12d-b6a7-341f-16d76d5aab80.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonDiameter Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonDiameter { get; }
```